micropython/micropython/stmhal/cmsis/devinc/stm32l471xx.h
/********************  Bit definition for RCC_AHB3ENR register  ***************/
#define  RCC_AHB3ENR_FMCEN                   ((uint32_t)0x00000001U)
#define  RCC_AHB3ENR_QSPIEN                  ((uint32_t)0x00000100U)

/********************  Bit definition for RCC_APB1ENR1 register  ***************/
#define  RCC_APB1ENR1_TIM2EN                 ((uint32_t)0x00000001U)
#define  RCC_APB1ENR1_TIM3EN                 ((uint32_t)0x00000002U)
#define  RCC_APB1ENR1_TIM4EN                 ((uint32_t)0x00000004U)
#define  RCC_APB1ENR1_TIM5EN                 ((uint32_t)0x00000008U)
#define  RCC_APB1ENR1_TIM6EN                 ((uint32_t)0x00000010U)
#define  RCC_APB1ENR1_TIM7EN                 ((uint32_t)0x00000020U)
#define  RCC_APB1ENR1_WWDGEN                 ((uint32_t)0x00000800U)
#define  RCC_APB1ENR1_SPI2EN                 ((uint32_t)0x00004000U)
#define  RCC_APB1ENR1_SPI3EN                 ((uint32_t)0x00008000U)
#define  RCC_APB1ENR1_USART2EN               ((uint32_t)0x00020000U)
#define  RCC_APB1ENR1_USART3EN               ((uint32_t)0x00040000U)
#define  RCC_APB1ENR1_UART4EN                ((uint32_t)0x00080000U)
#define  RCC_APB1ENR1_UART5EN                ((uint32_t)0x00100000U)
#define  RCC_APB1ENR1_I2C1EN                 ((uint32_t)0x00200000U)
#define  RCC_APB1ENR1_I2C2EN                 ((uint32_t)0x00400000U)
#define  RCC_APB1ENR1_I2C3EN                 ((uint32_t)0x00800000U)
#define  RCC_APB1ENR1_CAN1EN                 ((uint32_t)0x02000000U)
#define  RCC_APB1ENR1_PWREN                  ((uint32_t)0x10000000U)
#define  RCC_APB1ENR1_DAC1EN                 ((uint32_t)0x20000000U)
#define  RCC_APB1ENR1_OPAMPEN                ((uint32_t)0x40000000U)
#define  RCC_APB1ENR1_LPTIM1EN               ((uint32_t)0x80000000U)

/********************  Bit definition for RCC_APB1RSTR2 register  **************/
#define  RCC_APB1ENR2_LPUART1EN              ((uint32_t)0x00000001U)
#define  RCC_APB1ENR2_SWPMI1EN               ((uint32_t)0x00000004U)
#define  RCC_APB1ENR2_LPTIM2EN               ((uint32_t)0x00000020U)

/********************  Bit definition for RCC_APB2ENR register  ***************/
#define  RCC_APB2ENR_SYSCFGEN                ((uint32_t)0x00000001U)
#define  RCC_APB2ENR_FWEN                    ((uint32_t)0x00000080U)
#define  RCC_APB2ENR_SDMMC1EN                ((uint32_t)0x00000400U)
#define  RCC_APB2ENR_TIM1EN                  ((uint32_t)0x00000800U)
#define  RCC_APB2ENR_SPI1EN                  ((uint32_t)0x00001000U)
#define  RCC_APB2ENR_TIM8EN                  ((uint32_t)0x00002000U)
#define  RCC_APB2ENR_USART1EN                ((uint32_t)0x00004000U)
#define  RCC_APB2ENR_TIM15EN                 ((uint32_t)0x00010000U)
#define  RCC_APB2ENR_TIM16EN                 ((uint32_t)0x00020000U)
#define  RCC_APB2ENR_TIM17EN                 ((uint32_t)0x00040000U)
#define  RCC_APB2ENR_SAI1EN                  ((uint32_t)0x00200000U)
#define  RCC_APB2ENR_SAI2EN                  ((uint32_t)0x00400000U)
#define  RCC_APB2ENR_DFSDMEN                 ((uint32_t)0x01000000U)

/********************  Bit definition for RCC_AHB1SMENR register  ***************/
#define  RCC_AHB1SMENR_DMA1SMEN              ((uint32_t)0x00000001U)
#define  RCC_AHB1SMENR_DMA2SMEN              ((uint32_t)0x00000002U)
#define  RCC_AHB1SMENR_FLASHSMEN             ((uint32_t)0x00000100U)
#define  RCC_AHB1SMENR_SRAM1SMEN             ((uint32_t)0x00000200U)
#define  RCC_AHB1SMENR_CRCSMEN               ((uint32_t)0x00001000U)
#define  RCC_AHB1SMENR_TSCSMEN               ((uint32_t)0x00010000U)

/********************  Bit definition for RCC_AHB2SMENR register  *************/
#define  RCC_AHB2SMENR_GPIOASMEN             ((uint32_t)0x00000001U)
#define  RCC_AHB2SMENR_GPIOBSMEN             ((uint32_t)0x00000002U)
#define  RCC_AHB2SMENR_GPIOCSMEN             ((uint32_t)0x00000004U)
#define  RCC_AHB2SMENR_GPIODSMEN             ((uint32_t)0x00000008U)
#define  RCC_AHB2SMENR_GPIOESMEN             ((uint32_t)0x00000010U)
#define  RCC_AHB2SMENR_GPIOFSMEN             ((uint32_t)0x00000020U)
#define  RCC_AHB2SMENR_GPIOGSMEN             ((uint32_t)0x00000040U)
#define  RCC_AHB2SMENR_GPIOHSMEN             ((uint32_t)0x00000080U)
#define  RCC_AHB2SMENR_SRAM2SMEN             ((uint32_t)0x00000200U)
#define  RCC_AHB2SMENR_OTGFSSMEN             ((uint32_t)0x00001000U)
#define  RCC_AHB2SMENR_ADCSMEN               ((uint32_t)0x00002000U)
#define  RCC_AHB2SMENR_RNGSMEN               ((uint32_t)0x00040000U)

/********************  Bit definition for RCC_AHB3SMENR register  *************/
#define  RCC_AHB3SMENR_FMCSMEN               ((uint32_t)0x00000001U)
#define  RCC_AHB3SMENR_QSPISMEN              ((uint32_t)0x00000100U)

/********************  Bit definition for RCC_APB1SMENR1 register  *************/
#define  RCC_APB1SMENR1_TIM2SMEN             ((uint32_t)0x00000001U)
#define  RCC_APB1SMENR1_TIM3SMEN             ((uint32_t)0x00000002U)
#define  RCC_APB1SMENR1_TIM4SMEN             ((uint32_t)0x00000004U)
#define  RCC_APB1SMENR1_TIM5SMEN             ((uint32_t)0x00000008U)
#define  RCC_APB1SMENR1_TIM6SMEN             ((uint32_t)0x00000010U)
#define  RCC_APB1SMENR1_TIM7SMEN             ((uint32_t)0x00000020U)
#define  RCC_APB1SMENR1_WWDGSMEN             ((uint32_t)0x00000800U)
#define  RCC_APB1SMENR1_SPI2SMEN             ((uint32_t)0x00004000U)
#define  RCC_APB1SMENR1_SPI3SMEN             ((uint32_t)0x00008000U)
#define  RCC_APB1SMENR1_USART2SMEN           ((uint32_t)0x00020000U)
#define  RCC_APB1SMENR1_USART3SMEN           ((uint32_t)0x00040000U)
#define  RCC_APB1SMENR1_UART4SMEN            ((uint32_t)0x00080000U)
#define  RCC_APB1SMENR1_UART5SMEN            ((uint32_t)0x00100000U)
#define  RCC_APB1SMENR1_I2C1SMEN             ((uint32_t)0x00200000U)
#define  RCC_APB1SMENR1_I2C2SMEN             ((uint32_t)0x00400000U)
#define  RCC_APB1SMENR1_I2C3SMEN             ((uint32_t)0x00800000U)
#define  RCC_APB1SMENR1_CAN1SMEN             ((uint32_t)0x02000000U)
#define  RCC_APB1SMENR1_PWRSMEN              ((uint32_t)0x10000000U)
#define  RCC_APB1SMENR1_DAC1SMEN             ((uint32_t)0x20000000U)
#define  RCC_APB1SMENR1_OPAMPSMEN            ((uint32_t)0x40000000U)
#define  RCC_APB1SMENR1_LPTIM1SMEN           ((uint32_t)0x80000000U)

/********************  Bit definition for RCC_APB1SMENR2 register  *************/
#define  RCC_APB1SMENR2_LPUART1SMEN          ((uint32_t)0x00000001U)
#define  RCC_APB1SMENR2_SWPMI1SMEN           ((uint32_t)0x00000004U)
#define  RCC_APB1SMENR2_LPTIM2SMEN           ((uint32_t)0x00000020U)

/********************  Bit definition for RCC_APB2SMENR register  *************/
#define  RCC_APB2SMENR_SYSCFGSMEN            ((uint32_t)0x00000001U)
#define  RCC_APB2SMENR_SDMMC1SMEN            ((uint32_t)0x00000400U)
#define  RCC_APB2SMENR_TIM1SMEN              ((uint32_t)0x00000800U)
#define  RCC_APB2SMENR_SPI1SMEN              ((uint32_t)0x00001000U)
#define  RCC_APB2SMENR_TIM8SMEN              ((uint32_t)0x00002000U)
#define  RCC_APB2SMENR_USART1SMEN            ((uint32_t)0x00004000U)
#define  RCC_APB2SMENR_TIM15SMEN             ((uint32_t)0x00010000U)
#define  RCC_APB2SMENR_TIM16SMEN             ((uint32_t)0x00020000U)
#define  RCC_APB2SMENR_TIM17SMEN             ((uint32_t)0x00040000U)
#define  RCC_APB2SMENR_SAI1SMEN              ((uint32_t)0x00200000U)
#define  RCC_APB2SMENR_SAI2SMEN              ((uint32_t)0x00400000U)
#define  RCC_APB2SMENR_DFSDMSMEN             ((uint32_t)0x01000000U)

/********************  Bit definition for RCC_CCIPR register  ******************/
#define  RCC_CCIPR_USART1SEL                 ((uint32_t)0x00000003U)
#define  RCC_CCIPR_USART1SEL_0               ((uint32_t)0x00000001U)
#define  RCC_CCIPR_USART1SEL_1               ((uint32_t)0x00000002U)

#define  RCC_CCIPR_USART2SEL                 ((uint32_t)0x0000000CU)
#define  RCC_CCIPR_USART2SEL_0               ((uint32_t)0x00000004U)
#define  RCC_CCIPR_USART2SEL_1               ((uint32_t)0x00000008U)

