micropython/micropython/stmhal/cmsis/devinc/stm32l471xx.h
#define  RCC_CCIPR_USART3SEL                 ((uint32_t)0x00000030U)
#define  RCC_CCIPR_USART3SEL_0               ((uint32_t)0x00000010U)
#define  RCC_CCIPR_USART3SEL_1               ((uint32_t)0x00000020U)

#define  RCC_CCIPR_UART4SEL                  ((uint32_t)0x000000C0U)
#define  RCC_CCIPR_UART4SEL_0                ((uint32_t)0x00000040U)
#define  RCC_CCIPR_UART4SEL_1                ((uint32_t)0x00000080U)

#define  RCC_CCIPR_UART5SEL                  ((uint32_t)0x00000300U)
#define  RCC_CCIPR_UART5SEL_0                ((uint32_t)0x00000100U)
#define  RCC_CCIPR_UART5SEL_1                ((uint32_t)0x00000200U)

#define  RCC_CCIPR_LPUART1SEL                ((uint32_t)0x00000C00U)
#define  RCC_CCIPR_LPUART1SEL_0              ((uint32_t)0x00000400U)
#define  RCC_CCIPR_LPUART1SEL_1              ((uint32_t)0x00000800U)

#define  RCC_CCIPR_I2C1SEL                   ((uint32_t)0x00003000U)
#define  RCC_CCIPR_I2C1SEL_0                 ((uint32_t)0x00001000U)
#define  RCC_CCIPR_I2C1SEL_1                 ((uint32_t)0x00002000U)

#define  RCC_CCIPR_I2C2SEL                   ((uint32_t)0x0000C000U)
#define  RCC_CCIPR_I2C2SEL_0                 ((uint32_t)0x00004000U)
#define  RCC_CCIPR_I2C2SEL_1                 ((uint32_t)0x00008000U)

#define  RCC_CCIPR_I2C3SEL                   ((uint32_t)0x00030000U)
#define  RCC_CCIPR_I2C3SEL_0                 ((uint32_t)0x00010000U)
#define  RCC_CCIPR_I2C3SEL_1                 ((uint32_t)0x00020000U)

#define  RCC_CCIPR_LPTIM1SEL                 ((uint32_t)0x000C0000U)
#define  RCC_CCIPR_LPTIM1SEL_0               ((uint32_t)0x00040000U)
#define  RCC_CCIPR_LPTIM1SEL_1               ((uint32_t)0x00080000U)

#define  RCC_CCIPR_LPTIM2SEL                 ((uint32_t)0x00300000U)
#define  RCC_CCIPR_LPTIM2SEL_0               ((uint32_t)0x00100000U)
#define  RCC_CCIPR_LPTIM2SEL_1               ((uint32_t)0x00200000U)

#define  RCC_CCIPR_SAI1SEL                   ((uint32_t)0x00C00000U)
#define  RCC_CCIPR_SAI1SEL_0                 ((uint32_t)0x00400000U)
#define  RCC_CCIPR_SAI1SEL_1                 ((uint32_t)0x00800000U)

#define  RCC_CCIPR_SAI2SEL                   ((uint32_t)0x03000000U)
#define  RCC_CCIPR_SAI2SEL_0                 ((uint32_t)0x01000000U)
#define  RCC_CCIPR_SAI2SEL_1                 ((uint32_t)0x02000000U)

#define  RCC_CCIPR_CLK48SEL                  ((uint32_t)0x0C000000U)
#define  RCC_CCIPR_CLK48SEL_0                ((uint32_t)0x04000000U)
#define  RCC_CCIPR_CLK48SEL_1                ((uint32_t)0x08000000U)

#define  RCC_CCIPR_ADCSEL                    ((uint32_t)0x30000000U)
#define  RCC_CCIPR_ADCSEL_0                  ((uint32_t)0x10000000U)
#define  RCC_CCIPR_ADCSEL_1                  ((uint32_t)0x20000000U)

#define  RCC_CCIPR_SWPMI1SEL                 ((uint32_t)0x40000000U)
#define  RCC_CCIPR_DFSDMSEL                  ((uint32_t)0x80000000U)

/********************  Bit definition for RCC_BDCR register  ******************/
#define  RCC_BDCR_LSEON                      ((uint32_t)0x00000001U)
#define  RCC_BDCR_LSERDY                     ((uint32_t)0x00000002U)
#define  RCC_BDCR_LSEBYP                     ((uint32_t)0x00000004U)

#define  RCC_BDCR_LSEDRV                     ((uint32_t)0x00000018U)
#define  RCC_BDCR_LSEDRV_0                   ((uint32_t)0x00000008U)
#define  RCC_BDCR_LSEDRV_1                   ((uint32_t)0x00000010U)

#define  RCC_BDCR_LSECSSON                   ((uint32_t)0x00000020U)
#define  RCC_BDCR_LSECSSD                    ((uint32_t)0x00000040U)

#define  RCC_BDCR_RTCSEL                     ((uint32_t)0x00000300U)
#define  RCC_BDCR_RTCSEL_0                   ((uint32_t)0x00000100U)
#define  RCC_BDCR_RTCSEL_1                   ((uint32_t)0x00000200U)

#define  RCC_BDCR_RTCEN                      ((uint32_t)0x00008000U)
#define  RCC_BDCR_BDRST                      ((uint32_t)0x00010000U)
#define  RCC_BDCR_LSCOEN                     ((uint32_t)0x01000000U)
#define  RCC_BDCR_LSCOSEL                    ((uint32_t)0x02000000U)

/********************  Bit definition for RCC_CSR register  *******************/
#define  RCC_CSR_LSION                       ((uint32_t)0x00000001U)
#define  RCC_CSR_LSIRDY                      ((uint32_t)0x00000002U)

#define  RCC_CSR_MSISRANGE                   ((uint32_t)0x00000F00U)
#define  RCC_CSR_MSISRANGE_1                 ((uint32_t)0x00000400U)      /*!< MSI frequency 1MHZ */
#define  RCC_CSR_MSISRANGE_2                 ((uint32_t)0x00000500U)      /*!< MSI frequency 2MHZ */
#define  RCC_CSR_MSISRANGE_4                 ((uint32_t)0x00000600U)      /*!< The default frequency 4MHZ */
#define  RCC_CSR_MSISRANGE_8                 ((uint32_t)0x00000700U)      /*!< MSI frequency 8MHZ */

#define  RCC_CSR_RMVF                        ((uint32_t)0x00800000U)
#define  RCC_CSR_FWRSTF                      ((uint32_t)0x01000000U)
#define  RCC_CSR_OBLRSTF                     ((uint32_t)0x02000000U)
#define  RCC_CSR_PINRSTF                     ((uint32_t)0x04000000U)
#define  RCC_CSR_BORRSTF                     ((uint32_t)0x08000000U)
#define  RCC_CSR_SFTRSTF                     ((uint32_t)0x10000000U)
#define  RCC_CSR_IWDGRSTF                    ((uint32_t)0x20000000U)
#define  RCC_CSR_WWDGRSTF                    ((uint32_t)0x40000000U)
#define  RCC_CSR_LPWRRSTF                    ((uint32_t)0x80000000U)



/******************************************************************************/
/*                                                                            */
/*                                    RNG                                     */
/*                                                                            */
/******************************************************************************/
/********************  Bits definition for RNG_CR register  *******************/
#define RNG_CR_RNGEN                         ((uint32_t)0x00000004U)
#define RNG_CR_IE                            ((uint32_t)0x00000008U)

/********************  Bits definition for RNG_SR register  *******************/
#define RNG_SR_DRDY                          ((uint32_t)0x00000001U)
#define RNG_SR_CECS                          ((uint32_t)0x00000002U)
#define RNG_SR_SECS                          ((uint32_t)0x00000004U)
#define RNG_SR_CEIS                          ((uint32_t)0x00000020U)
#define RNG_SR_SEIS                          ((uint32_t)0x00000040U)

/******************************************************************************/
/*                                                                            */
/*                           Real-Time Clock (RTC)                            */
/*                                                                            */
/******************************************************************************/
/*
* @brief Specific device feature definitions
*/
#define RTC_TAMPER1_SUPPORT
#define RTC_TAMPER3_SUPPORT
#define RTC_WAKEUP_SUPPORT
#define RTC_BACKUP_SUPPORT

/********************  Bits definition for RTC_TR register  *******************/
#define RTC_TR_PM                            ((uint32_t)0x00400000U)
#define RTC_TR_HT                            ((uint32_t)0x00300000U)
#define RTC_TR_HT_0                          ((uint32_t)0x00100000U)
#define RTC_TR_HT_1                          ((uint32_t)0x00200000U)
#define RTC_TR_HU                            ((uint32_t)0x000F0000U)
#define RTC_TR_HU_0                          ((uint32_t)0x00010000U)
#define RTC_TR_HU_1                          ((uint32_t)0x00020000U)
#define RTC_TR_HU_2                          ((uint32_t)0x00040000U)
#define RTC_TR_HU_3                          ((uint32_t)0x00080000U)
#define RTC_TR_MNT                           ((uint32_t)0x00007000U)
#define RTC_TR_MNT_0                         ((uint32_t)0x00001000U)
#define RTC_TR_MNT_1                         ((uint32_t)0x00002000U)
#define RTC_TR_MNT_2                         ((uint32_t)0x00004000U)
#define RTC_TR_MNU                           ((uint32_t)0x00000F00U)
#define RTC_TR_MNU_0                         ((uint32_t)0x00000100U)
#define RTC_TR_MNU_1                         ((uint32_t)0x00000200U)
#define RTC_TR_MNU_2                         ((uint32_t)0x00000400U)
#define RTC_TR_MNU_3                         ((uint32_t)0x00000800U)
#define RTC_TR_ST                            ((uint32_t)0x00000070U)
#define RTC_TR_ST_0                          ((uint32_t)0x00000010U)
#define RTC_TR_ST_1                          ((uint32_t)0x00000020U)
#define RTC_TR_ST_2                          ((uint32_t)0x00000040U)
#define RTC_TR_SU                            ((uint32_t)0x0000000FU)
#define RTC_TR_SU_0                          ((uint32_t)0x00000001U)
#define RTC_TR_SU_1                          ((uint32_t)0x00000002U)
#define RTC_TR_SU_2                          ((uint32_t)0x00000004U)
#define RTC_TR_SU_3                          ((uint32_t)0x00000008U)

