micropython/micropython/stmhal/cmsis/devinc/stm32l471xx.h
/********************  Bits definition for RTC_WPR register  ******************/
#define RTC_WPR_KEY                          ((uint32_t)0x000000FFU)

/********************  Bits definition for RTC_SSR register  ******************/
#define RTC_SSR_SS                           ((uint32_t)0x0000FFFFU)

/********************  Bits definition for RTC_SHIFTR register  ***************/
#define RTC_SHIFTR_SUBFS                     ((uint32_t)0x00007FFFU)
#define RTC_SHIFTR_ADD1S                     ((uint32_t)0x80000000U)

/********************  Bits definition for RTC_TSTR register  *****************/
#define RTC_TSTR_PM                          ((uint32_t)0x00400000U)
#define RTC_TSTR_HT                          ((uint32_t)0x00300000U)
#define RTC_TSTR_HT_0                        ((uint32_t)0x00100000U)
#define RTC_TSTR_HT_1                        ((uint32_t)0x00200000U)
#define RTC_TSTR_HU                          ((uint32_t)0x000F0000U)
#define RTC_TSTR_HU_0                        ((uint32_t)0x00010000U)
#define RTC_TSTR_HU_1                        ((uint32_t)0x00020000U)
#define RTC_TSTR_HU_2                        ((uint32_t)0x00040000U)
#define RTC_TSTR_HU_3                        ((uint32_t)0x00080000U)
#define RTC_TSTR_MNT                         ((uint32_t)0x00007000U)
#define RTC_TSTR_MNT_0                       ((uint32_t)0x00001000U)
#define RTC_TSTR_MNT_1                       ((uint32_t)0x00002000U)
#define RTC_TSTR_MNT_2                       ((uint32_t)0x00004000U)
#define RTC_TSTR_MNU                         ((uint32_t)0x00000F00U)
#define RTC_TSTR_MNU_0                       ((uint32_t)0x00000100U)
#define RTC_TSTR_MNU_1                       ((uint32_t)0x00000200U)
#define RTC_TSTR_MNU_2                       ((uint32_t)0x00000400U)
#define RTC_TSTR_MNU_3                       ((uint32_t)0x00000800U)
#define RTC_TSTR_ST                          ((uint32_t)0x00000070U)
#define RTC_TSTR_ST_0                        ((uint32_t)0x00000010U)
#define RTC_TSTR_ST_1                        ((uint32_t)0x00000020U)
#define RTC_TSTR_ST_2                        ((uint32_t)0x00000040U)
#define RTC_TSTR_SU                          ((uint32_t)0x0000000FU)
#define RTC_TSTR_SU_0                        ((uint32_t)0x00000001U)
#define RTC_TSTR_SU_1                        ((uint32_t)0x00000002U)
#define RTC_TSTR_SU_2                        ((uint32_t)0x00000004U)
#define RTC_TSTR_SU_3                        ((uint32_t)0x00000008U)

/********************  Bits definition for RTC_TSDR register  *****************/
#define RTC_TSDR_WDU                         ((uint32_t)0x0000E000U)
#define RTC_TSDR_WDU_0                       ((uint32_t)0x00002000U)
#define RTC_TSDR_WDU_1                       ((uint32_t)0x00004000U)
#define RTC_TSDR_WDU_2                       ((uint32_t)0x00008000U)
#define RTC_TSDR_MT                          ((uint32_t)0x00001000U)
#define RTC_TSDR_MU                          ((uint32_t)0x00000F00U)
#define RTC_TSDR_MU_0                        ((uint32_t)0x00000100U)
#define RTC_TSDR_MU_1                        ((uint32_t)0x00000200U)
#define RTC_TSDR_MU_2                        ((uint32_t)0x00000400U)
#define RTC_TSDR_MU_3                        ((uint32_t)0x00000800U)
#define RTC_TSDR_DT                          ((uint32_t)0x00000030U)
#define RTC_TSDR_DT_0                        ((uint32_t)0x00000010U)
#define RTC_TSDR_DT_1                        ((uint32_t)0x00000020U)
#define RTC_TSDR_DU                          ((uint32_t)0x0000000FU)
#define RTC_TSDR_DU_0                        ((uint32_t)0x00000001U)
#define RTC_TSDR_DU_1                        ((uint32_t)0x00000002U)
#define RTC_TSDR_DU_2                        ((uint32_t)0x00000004U)
#define RTC_TSDR_DU_3                        ((uint32_t)0x00000008U)

/********************  Bits definition for RTC_TSSSR register  ****************/
#define RTC_TSSSR_SS                         ((uint32_t)0x0000FFFFU)

/********************  Bits definition for RTC_CAL register  *****************/
#define RTC_CALR_CALP                        ((uint32_t)0x00008000U)
#define RTC_CALR_CALW8                       ((uint32_t)0x00004000U)
#define RTC_CALR_CALW16                      ((uint32_t)0x00002000U)
#define RTC_CALR_CALM                        ((uint32_t)0x000001FFU)
#define RTC_CALR_CALM_0                      ((uint32_t)0x00000001U)
#define RTC_CALR_CALM_1                      ((uint32_t)0x00000002U)
#define RTC_CALR_CALM_2                      ((uint32_t)0x00000004U)
#define RTC_CALR_CALM_3                      ((uint32_t)0x00000008U)
#define RTC_CALR_CALM_4                      ((uint32_t)0x00000010U)
#define RTC_CALR_CALM_5                      ((uint32_t)0x00000020U)
#define RTC_CALR_CALM_6                      ((uint32_t)0x00000040U)
#define RTC_CALR_CALM_7                      ((uint32_t)0x00000080U)
#define RTC_CALR_CALM_8                      ((uint32_t)0x00000100U)

/********************  Bits definition for RTC_TAMPCR register  ***************/
#define RTC_TAMPCR_TAMP3MF                   ((uint32_t)0x01000000U)
#define RTC_TAMPCR_TAMP3NOERASE              ((uint32_t)0x00800000U)
#define RTC_TAMPCR_TAMP3IE                   ((uint32_t)0x00400000U)
#define RTC_TAMPCR_TAMP2MF                   ((uint32_t)0x00200000U)
#define RTC_TAMPCR_TAMP2NOERASE              ((uint32_t)0x00100000U)
#define RTC_TAMPCR_TAMP2IE                   ((uint32_t)0x00080000U)
#define RTC_TAMPCR_TAMP1MF                   ((uint32_t)0x00040000U)
#define RTC_TAMPCR_TAMP1NOERASE              ((uint32_t)0x00020000U)
#define RTC_TAMPCR_TAMP1IE                   ((uint32_t)0x00010000U)
#define RTC_TAMPCR_TAMPPUDIS                 ((uint32_t)0x00008000U)
#define RTC_TAMPCR_TAMPPRCH                  ((uint32_t)0x00006000U)
#define RTC_TAMPCR_TAMPPRCH_0                ((uint32_t)0x00002000U)
#define RTC_TAMPCR_TAMPPRCH_1                ((uint32_t)0x00004000U)
#define RTC_TAMPCR_TAMPFLT                   ((uint32_t)0x00001800U)
#define RTC_TAMPCR_TAMPFLT_0                 ((uint32_t)0x00000800U)
#define RTC_TAMPCR_TAMPFLT_1                 ((uint32_t)0x00001000U)
#define RTC_TAMPCR_TAMPFREQ                  ((uint32_t)0x00000700U)
#define RTC_TAMPCR_TAMPFREQ_0                ((uint32_t)0x00000100U)
#define RTC_TAMPCR_TAMPFREQ_1                ((uint32_t)0x00000200U)
#define RTC_TAMPCR_TAMPFREQ_2                ((uint32_t)0x00000400U)
#define RTC_TAMPCR_TAMPTS                    ((uint32_t)0x00000080U)
#define RTC_TAMPCR_TAMP3TRG                  ((uint32_t)0x00000040U)
#define RTC_TAMPCR_TAMP3E                    ((uint32_t)0x00000020U)
#define RTC_TAMPCR_TAMP2TRG                  ((uint32_t)0x00000010U)
#define RTC_TAMPCR_TAMP2E                    ((uint32_t)0x00000008U)
#define RTC_TAMPCR_TAMPIE                    ((uint32_t)0x00000004U)
#define RTC_TAMPCR_TAMP1TRG                  ((uint32_t)0x00000002U)
#define RTC_TAMPCR_TAMP1E                    ((uint32_t)0x00000001U)

